Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider class provides the creation commands for creating a construction object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider class.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider.Arc
Gets the creation command parameters for creating a construction arc.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider.UsingOffset
Gets the creation command parameters for creating a construction object using offset.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider.Circle
Gets the creation command parameters for creating a construction circle.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ConstructionObjectTypeProvider.Polycurve
Gets the creation command parameters for creating a construction polycurve.